// Данный пример иллюстрирует загрузку взаимозависимых модулей 

// Когда main.js загружает a.js, a.js, в свою очередь, загружает b.js. В это же время b.js пытается 
// загрузить a.js. Чтобы предотвратить создание бесконечного цикла, незаконченная копия объекта exports 
// модуля a.js передается модулю b.js. Тогда b.js заканчивает загрузку и его объект exports передается 
// модулю a.js 

console.log('main starting');
const a = require('./a.js');
const b = require('./b.js');
console.log('in main, a.done=%s, b.done=%s',
              a.done, b.done);